import random

answers = {
    'Бесспорно', 'Мне кажется - да', 'Пока неясно', 'Попробуй снова', 'Даже не думай',
    'Предрешено', 'Вероятнее всего', 'Спроси позже', 'Мой ответ - нет',
    'Никаких сомнений', 'Хорошие перспективы', 'Лучше не рассказывать', 'По моим данным - нет',
    'Определённо да', 'Знаки говорят - да', 'Сейчас нельзя предсказать', 'Перспективы не очень хорошие',
    'Можешь быть уверен в этом', 'Да', 'Сконцентрируйся и спроси опять', 'Весьма сомнительно'
}


def choice():
    pass


def main():
    pass


print('Привет Мир, я магический шар, и я знаю ответ на любой твой вопрос.')
print('Введите ваше имя: ', end='')
user_name = input()
print('')
print('*' * 20)
print('')
print(f'Привет {user_name}!')

while True:
    pass
